iapetuszzb/car/Drivers/K210/k210_face.c
#include "k210_face.h"

#include "clock.h"
#include "main.h"
#include "stepper_gimbal.h"
#include "ti_msp_dl_config.h"

#include <stddef.h>
#include <string.h>

#define K210_FACE_IMAGE_W                  (320)
#define K210_FACE_IMAGE_H                  (240)
#define K210_FACE_CENTER_X                 (K210_FACE_IMAGE_W / 2)
#define K210_FACE_CENTER_Y                 (K210_FACE_IMAGE_H / 2)
#define K210_FACE_MIN_SCORE_PERMILLE       (600U)
#define K210_FACE_GIMBAL_OUTPUT_ENABLE     (APP_ENABLE_STEPPER_GIMBAL)

#define K210_FACE_CONTROL_INTERVAL_MS      (10U)
#define K210_FACE_TARGET_FRESH_TIMEOUT_MS  (120U)
#define K210_FACE_PREDICTION_TIME_S        (0.0f)

#define K210_FACE_SPEED_X_KP               (0.02f)
#define K210_FACE_SPEED_X_KI               (0.0f)
#define K210_FACE_SPEED_X_KD               (0.02f)
#define K210_FACE_SPEED_Y_KP               (0.02f)
#define K210_FACE_SPEED_Y_KI               (0.0f)
#define K210_FACE_SPEED_Y_KD               (0.02f)
#define K210_FACE_SPEED_PID_OUT_MAX        (2000.0f)
#define K210_FACE_SPEED_PID_I_MAX          (80.0f)

#define K210_FACE_A_MIN_STEP_HZ            (80U)
#define K210_FACE_A_MAX_STEP_HZ            (1800U)
#define K210_FACE_B_MIN_STEP_HZ            (60U)
#define K210_FACE_B_MAX_STEP_HZ            (800U)
#define K210_FACE_SPEED_STOP_EPS_HZ        (1.0f)
#define K210_FACE_CENTER_DEADZONE_X        (10)
#define K210_FACE_CENTER_DEADZONE_Y        (10)
#define K210_FACE_A_ERR_SMALL              (10.0f)
#define K210_FACE_A_ERR_LARGE              (45.0f)
#define K210_FACE_B_ERR_SMALL              (10.0f)
#define K210_FACE_B_ERR_LARGE              (30.0f)
#define K210_FACE_A_SPEED_LIMIT_SMALL      (220.0f)
#define K210_FACE_A_SPEED_LIMIT_MID        (800.0f)
#define K210_FACE_A_SPEED_LIMIT_LARGE      (1600.0f)
#define K210_FACE_B_SPEED_LIMIT_SMALL      (90.0f)
#define K210_FACE_B_SPEED_LIMIT_MID        (260.0f)
#define K210_FACE_B_SPEED_LIMIT_LARGE      (560.0f)
#define K210_FACE_A_ACCEL_SMALL            (3000.0f)
#define K210_FACE_A_ACCEL_MID              (4500.0f)
#define K210_FACE_A_ACCEL_LARGE            (6000.0f)
#define K210_FACE_B_ACCEL_SMALL            (1000.0f)
#define K210_FACE_B_ACCEL_MID              (1800.0f)
#define K210_FACE_B_ACCEL_LARGE            (2600.0f)

/*
 * The pitch axis uses the opposite closed-loop sign from the pan axis. If this
 * is wrong, targets above/below center are pushed farther away from center.
 */
#define K210_FACE_AXIS_A_DIR               (-1.0f)
#define K210_FACE_AXIS_B_DIR               (1.0f)

#define K210_FACE_USE_UART_DMA             (1)
#define K210_FACE_DMA_RX_CH                (0U)
#define K210_FACE_DMA_TX_CH                (1U)
#define K210_FACE_DMA_RX_BUFFER_LEN        (16U)
#define K210_FACE_DMA_TX_BUFFER_LEN        (96U)
#define K210_FACE_DMA_RX_INTERRUPT         (DL_DMA_INTERRUPT_CHANNEL0)
#define K210_FACE_DMA_TX_INTERRUPT         (DL_DMA_INTERRUPT_CHANNEL1)
#define K210_FACE_DMA_ERROR_INTERRUPTS \
    (DL_DMA_INTERRUPT_ADDR_ERROR | DL_DMA_INTERRUPT_DATA_ERROR)
#define K210_FACE_RX_QUEUE_LEN             (16U)
#define K210_FACE_PARSE_LINES_PER_TASK     (16U)

#define K210_FACE_RX_LINE_LEN              (128U)
#define K210_FACE_COMPACT_MAX_ABS_ERROR    (1000)

/*
 * UART0 on PA10/PA11 is enabled by SysConfig, but the current board only sees
 * one stale/noise byte there. Use UART1 RX on PA9 for a clean hardware test.
 * Connect K210 P7(TX) -> PA9. Optional MCU TX uses PA17 -> K210 P6(RX).
 * PB9 and PA15 are not UART RX-capable pins on MSPM0G3507.
 */
#define K210_FACE_USE_UART1_PA9_RX         (1)

#if K210_FACE_USE_UART1_PA9_RX
#define K210_FACE_UART_INST                (UART1)
#define K210_FACE_UART_IRQN                (UART1_INT_IRQn)
#define K210_FACE_UART_RX_PORT             (GPIOA)
#define K210_FACE_UART_RX_PIN              (DL_GPIO_PIN_9)
#define K210_FACE_UART_RX_IOMUX            (IOMUX_PINCM20)
#define K210_FACE_UART_RX_IOMUX_FUNC       (IOMUX_PINCM20_PF_UART1_RX)
#define K210_FACE_UART_TX_PORT             (GPIOA)
#define K210_FACE_UART_TX_PIN              (DL_GPIO_PIN_17)
#define K210_FACE_UART_TX_IOMUX            (IOMUX_PINCM39)
#define K210_FACE_UART_TX_IOMUX_FUNC       (IOMUX_PINCM39_PF_UART1_TX)
#define K210_FACE_UART_RX_DMA_TRIGGER      (DMA_UART1_RX_TRIG)
#define K210_FACE_UART_TX_DMA_TRIGGER      (DMA_UART1_TX_TRIG)
#define K210_FACE_UART_MANUAL_INIT         (1)
#else
#define K210_FACE_UART_INST                (UART_0_INST)
#define K210_FACE_UART_IRQN                (UART_0_INST_INT_IRQN)
#define K210_FACE_UART_RX_PORT             (GPIO_UART_0_RX_PORT)
#define K210_FACE_UART_RX_PIN              (GPIO_UART_0_RX_PIN)
#define K210_FACE_UART_RX_IOMUX            (GPIO_UART_0_IOMUX_RX)
#define K210_FACE_UART_RX_IOMUX_FUNC       (GPIO_UART_0_IOMUX_RX_FUNC)
#define K210_FACE_UART_TX_PORT             (GPIO_UART_0_TX_PORT)
#define K210_FACE_UART_TX_PIN              (GPIO_UART_0_TX_PIN)
#define K210_FACE_UART_TX_IOMUX            (GPIO_UART_0_IOMUX_TX)
#define K210_FACE_UART_TX_IOMUX_FUNC       (GPIO_UART_0_IOMUX_TX_FUNC)
#define K210_FACE_UART_RX_DMA_TRIGGER      (DMA_UART0_RX_TRIG)
#define K210_FACE_UART_TX_DMA_TRIGGER      (DMA_UART0_TX_TRIG)
#define K210_FACE_UART_MANUAL_INIT         (0)
#endif

#define K210_FACE_UART_IBRD_40_MHZ_115200  (21U)
#define K210_FACE_UART_FBRD_40_MHZ_115200  (45U)

#if K210_FACE_USE_UART_DMA
#define K210_FACE_UART_RX_INTERRUPTS                                      \
    (DL_UART_MAIN_INTERRUPT_RX_TIMEOUT_ERROR |                            \
     DL_UART_MAIN_INTERRUPT_OVERRUN_ERROR |                               \
     DL_UART_MAIN_INTERRUPT_BREAK_ERROR |                                 \
     DL_UART_MAIN_INTERRUPT_PARITY_ERROR |                                \
     DL_UART_MAIN_INTERRUPT_FRAMING_ERROR |                               \
     DL_UART_MAIN_INTERRUPT_NOISE_ERROR)
#else
#define K210_FACE_UART_RX_INTERRUPTS                                      \
    (DL_UART_MAIN_INTERRUPT_RX | DL_UART_MAIN_INTERRUPT_RX_TIMEOUT_ERROR | \
     DL_UART_MAIN_INTERRUPT_OVERRUN_ERROR |                                \
     DL_UART_MAIN_INTERRUPT_BREAK_ERROR |                                  \
     DL_UART_MAIN_INTERRUPT_PARITY_ERROR |                                 \
     DL_UART_MAIN_INTERRUPT_FRAMING_ERROR |                                \
     DL_UART_MAIN_INTERRUPT_NOISE_ERROR)
#endif

#define K210_FACE_UART_RX_EDGE_INTERRUPTS \
    (DL_UART_MAIN_INTERRUPT_RXD_POS_EDGE | DL_UART_MAIN_INTERRUPT_RXD_NEG_EDGE)

