iapetuszzb/car/Drivers/K210/k210_face.c
typedef struct {
    float kp;
    float ki;
    float kd;
    float setpoint;
    float integral;
    float last_error;
    float last_input;
    bool input_ready;
} K210FacePid;

static volatile char g_rx_build_line[K210_FACE_RX_LINE_LEN];
static volatile char g_rx_line_queue[K210_FACE_RX_QUEUE_LEN][K210_FACE_RX_LINE_LEN];
static volatile uint32_t g_rx_index;
static volatile uint8_t g_rx_queue_head;
static volatile uint8_t g_rx_queue_tail;
static volatile uint8_t g_rx_queue_count;
static volatile uint32_t g_rx_overflow_count;

static K210FaceDetection g_latest_detection;
static bool g_has_detection;
static bool g_tracking_enabled = false;
static bool g_motors_enabled;
static volatile uint32_t g_rx_byte_count;
static volatile uint32_t g_rx_line_count;
static volatile uint32_t g_rx_edge_count;
static volatile uint32_t g_rx_error_count;
static volatile uint32_t g_rx_dma_block_count;
static volatile uint32_t g_tx_dma_done_count;
static volatile bool g_tx_dma_busy;
static volatile uint32_t g_valid_detection_count;
static volatile uint32_t g_parse_error_count;
static volatile uint8_t g_last_rx_byte;
static volatile uint8_t g_rx_pin_level;
static volatile uint32_t g_track_command_count;
static volatile int32_t g_last_error_x;
static volatile int32_t g_last_error_y;
static volatile uint16_t g_object_center_x;
static volatile uint16_t g_object_center_y;
static volatile bool g_target_valid;
static volatile uint32_t g_target_update_ms;
static uint32_t g_control_elapsed_ms;
static K210FacePid g_speed_pid_a;
static K210FacePid g_speed_pid_b;
static float g_error_vx;
static float g_error_vy;
static volatile int32_t g_predicted_error_x;
static volatile int32_t g_predicted_error_y;
static float g_command_speed_a_hz;
static float g_command_speed_b_hz;
static volatile bool g_target_frame_pending;
static volatile uint8_t g_compact_parse_state;
static volatile int32_t g_compact_parse_values[3];
static volatile int32_t g_compact_parse_value;
static volatile int8_t g_compact_parse_sign;
static volatile bool g_compact_parse_has_digit;
static volatile int32_t g_compact_error_x;
static volatile int32_t g_compact_error_y;
static volatile uint8_t g_compact_target_valid;
static volatile bool g_compact_frame_pending;

#if K210_FACE_USE_UART_DMA
static volatile uint8_t g_dma_rx_buffer[K210_FACE_DMA_RX_BUFFER_LEN];
static uint8_t g_dma_tx_buffer[K210_FACE_DMA_TX_BUFFER_LEN];
#endif

static int32_t abs_i32(int32_t value)
{
    return (value < 0) ? -value : value;
}

static int32_t clamp_i32(int32_t value, int32_t min_value, int32_t max_value)
{
    if (value < min_value) {
        return min_value;
    }
    if (value > max_value) {
        return max_value;
    }
    return value;
}

static float abs_f32(float value)
{
    return (value < 0.0f) ? -value : value;
}

static float clamp_f32(float value, float min_value, float max_value)
{
    if (value < min_value) {
        return min_value;
    }
    if (value > max_value) {
        return max_value;
    }
    return value;
}

static uint8_t next_rx_queue_index(uint8_t index)
{
    index++;
    if (index >= K210_FACE_RX_QUEUE_LEN) {
        index = 0U;
    }
    return index;
}

static void compact_parser_start_field(uint8_t field)
{
    if (field == 1U) {
        g_compact_parse_values[0] = 0;
        g_compact_parse_values[1] = 0;
        g_compact_parse_values[2] = 0;
    }
    g_compact_parse_state = field;
    g_compact_parse_value = 0;
    g_compact_parse_sign = 1;
    g_compact_parse_has_digit = false;
}

static void compact_parser_finish_field(void)
{
    if ((g_compact_parse_state >= 1U) &&
        (g_compact_parse_state <= 3U) &&
        g_compact_parse_has_digit) {
        g_compact_parse_values[g_compact_parse_state - 1U] =
            g_compact_parse_value * (int32_t)g_compact_parse_sign;
    }
}

static bool compact_rx_byte(uint8_t byte)
{
    if (byte == 'X') {
        compact_parser_start_field(1U);
        return true;
    }
    if (g_compact_parse_state == 0U) {
        return false;
    }
    if (byte == 'Y') {
        compact_parser_finish_field();
        compact_parser_start_field(2U);
        return true;
    }
    if (byte == 'Z') {
        compact_parser_finish_field();
        compact_parser_start_field(3U);
        return true;
    }
    if (byte == 'E') {
        compact_parser_finish_field();
        g_compact_parse_state = 0U;
        if ((abs_i32(g_compact_parse_values[0]) <=
             K210_FACE_COMPACT_MAX_ABS_ERROR) &&
            (abs_i32(g_compact_parse_values[1]) <=
             K210_FACE_COMPACT_MAX_ABS_ERROR)) {
            g_compact_error_x = g_compact_parse_values[0];
            g_compact_error_y = g_compact_parse_values[1];
            g_compact_target_valid =
                (g_compact_parse_values[2] != 0) ? 1U : 0U;
            if (g_compact_target_valid != 0U) {
                g_valid_detection_count++;
            }
            g_compact_frame_pending = true;
        }
        return true;
    }

    if ((byte == '\r') || (byte == '\n')) {
        g_compact_parse_state = 0U;
        return true;
    }
    if ((byte == '-') && !g_compact_parse_has_digit) {
        g_compact_parse_sign = -1;
        return true;
    }
    if ((byte >= '0') && (byte <= '9')) {
        g_compact_parse_value =
            (g_compact_parse_value * 10) + (int32_t)(byte - '0');
        g_compact_parse_has_digit = true;
        if (g_compact_parse_value > K210_FACE_COMPACT_MAX_ABS_ERROR) {
            g_compact_parse_value = K210_FACE_COMPACT_MAX_ABS_ERROR;
        }
        return true;
    }

    return true;
}

static void k210_rx_byte(uint8_t byte)
{
    uint32_t i;
    uint8_t write_index;
    bool compact_byte;

    g_rx_byte_count++;
    g_last_rx_byte = byte;
    compact_byte = compact_rx_byte(byte);
    if (compact_byte) {
        return;
    }

    if ((byte == '\r') || (byte == '\n')) {
        if (g_rx_index == 0U) {
            return;
        }

        g_rx_build_line[g_rx_index] = '\0';
        if (g_rx_queue_count >= K210_FACE_RX_QUEUE_LEN) {
            g_rx_queue_tail = next_rx_queue_index(g_rx_queue_tail);
            g_rx_queue_count--;
            g_rx_overflow_count++;
        }

        write_index = g_rx_queue_head;
        for (i = 0U; i <= g_rx_index; i++) {
            g_rx_line_queue[write_index][i] = g_rx_build_line[i];
        }
        g_rx_queue_head = next_rx_queue_index(g_rx_queue_head);
        g_rx_queue_count++;
        g_rx_line_count++;
        g_rx_index = 0U;
        return;
    }

    if (g_rx_index < (K210_FACE_RX_LINE_LEN - 1U)) {
        g_rx_build_line[g_rx_index++] = (char)byte;
    } else {
        g_rx_index = 0U;
        g_rx_overflow_count++;
    }
}

