iapetuszzb/car/Drivers/K210/k210_face.c
static void drain_uart_rx_fifo(void)
{
    while (!DL_UART_Main_isRXFIFOEmpty(K210_FACE_UART_INST)) {
        k210_rx_byte(DL_UART_Main_receiveData(K210_FACE_UART_INST));
    }
}

static void sample_uart_rx_pin(void)
{
    g_rx_pin_level =
        ((DL_GPIO_readPins(K210_FACE_UART_RX_PORT, K210_FACE_UART_RX_PIN) &
          K210_FACE_UART_RX_PIN) != 0U) ? 1U : 0U;
}

static void drain_uart_rx_fifo_from_task(void)
{
#if !K210_FACE_USE_UART_DMA
    NVIC_DisableIRQ(K210_FACE_UART_IRQN);
    drain_uart_rx_fifo();
    NVIC_EnableIRQ(K210_FACE_UART_IRQN);
#endif
}

#if K210_FACE_USE_UART_DMA
static void process_dma_rx_bytes(uint32_t count)
{
    uint32_t i;

    if (count > K210_FACE_DMA_RX_BUFFER_LEN) {
        count = K210_FACE_DMA_RX_BUFFER_LEN;
    }

    for (i = 0U; i < count; i++) {
        k210_rx_byte(g_dma_rx_buffer[i]);
    }
}

static void start_dma_rx(void)
{
    DL_DMA_disableChannel(DMA, K210_FACE_DMA_RX_CH);
    DL_DMA_setSrcAddr(DMA, K210_FACE_DMA_RX_CH,
                      (uint32_t)&K210_FACE_UART_INST->RXDATA);
    DL_DMA_setDestAddr(DMA, K210_FACE_DMA_RX_CH,
                       (uint32_t)&g_dma_rx_buffer[0]);
    DL_DMA_setTransferSize(DMA, K210_FACE_DMA_RX_CH,
                           K210_FACE_DMA_RX_BUFFER_LEN);
    DL_DMA_enableChannel(DMA, K210_FACE_DMA_RX_CH);
}

static void process_dma_rx_partial(void)
{
    uint16_t remaining;
    uint32_t count;

    DL_DMA_disableChannel(DMA, K210_FACE_DMA_RX_CH);
    remaining = DL_DMA_getTransferSize(DMA, K210_FACE_DMA_RX_CH);
    count = K210_FACE_DMA_RX_BUFFER_LEN - remaining;
    process_dma_rx_bytes(count);
    drain_uart_rx_fifo();
    start_dma_rx();
}

static void init_uart_dma(void)
{
    static const DL_DMA_Config rx_config = {
        .transferMode  = DL_DMA_SINGLE_TRANSFER_MODE,
        .extendedMode  = DL_DMA_NORMAL_MODE,
        .destIncrement = DL_DMA_ADDR_INCREMENT,
        .srcIncrement  = DL_DMA_ADDR_UNCHANGED,
        .destWidth     = DL_DMA_WIDTH_BYTE,
        .srcWidth      = DL_DMA_WIDTH_BYTE,
        .trigger       = K210_FACE_UART_RX_DMA_TRIGGER,
        .triggerType   = DL_DMA_TRIGGER_TYPE_EXTERNAL,
    };
    static const DL_DMA_Config tx_config = {
        .transferMode  = DL_DMA_SINGLE_TRANSFER_MODE,
        .extendedMode  = DL_DMA_NORMAL_MODE,
        .destIncrement = DL_DMA_ADDR_UNCHANGED,
        .srcIncrement  = DL_DMA_ADDR_INCREMENT,
        .destWidth     = DL_DMA_WIDTH_BYTE,
        .srcWidth      = DL_DMA_WIDTH_BYTE,
        .trigger       = K210_FACE_UART_TX_DMA_TRIGGER,
        .triggerType   = DL_DMA_TRIGGER_TYPE_EXTERNAL,
    };

    DL_DMA_initChannel(DMA, K210_FACE_DMA_RX_CH, &rx_config);
    DL_DMA_initChannel(DMA, K210_FACE_DMA_TX_CH, &tx_config);
    DL_DMA_clearInterruptStatus(DMA,
        K210_FACE_DMA_RX_INTERRUPT | K210_FACE_DMA_TX_INTERRUPT |
        K210_FACE_DMA_ERROR_INTERRUPTS);
    DL_DMA_enableInterrupt(DMA,
        K210_FACE_DMA_RX_INTERRUPT | K210_FACE_DMA_TX_INTERRUPT |
        K210_FACE_DMA_ERROR_INTERRUPTS);
}
#endif

static void init_selected_uart(void)
{
#if K210_FACE_UART_MANUAL_INIT
    static const DL_UART_Main_ClockConfig clock_config = {
        .clockSel    = DL_UART_MAIN_CLOCK_BUSCLK,
        .divideRatio = DL_UART_MAIN_CLOCK_DIVIDE_RATIO_1,
    };
    static const DL_UART_Main_Config uart_config = {
        .mode        = DL_UART_MAIN_MODE_NORMAL,
        .direction   = DL_UART_MAIN_DIRECTION_TX_RX,
        .flowControl = DL_UART_MAIN_FLOW_CONTROL_NONE,
        .parity      = DL_UART_MAIN_PARITY_NONE,
        .wordLength  = DL_UART_MAIN_WORD_LENGTH_8_BITS,
        .stopBits    = DL_UART_MAIN_STOP_BITS_ONE,
    };

    DL_UART_Main_reset(K210_FACE_UART_INST);
    DL_UART_Main_enablePower(K210_FACE_UART_INST);
    delay_cycles(POWER_STARTUP_DELAY);
    DL_UART_Main_setClockConfig(K210_FACE_UART_INST,
                                (DL_UART_Main_ClockConfig *)&clock_config);
    DL_UART_Main_init(K210_FACE_UART_INST,
                      (DL_UART_Main_Config *)&uart_config);
    DL_UART_Main_setOversampling(K210_FACE_UART_INST,
                                 DL_UART_OVERSAMPLING_RATE_16X);
    DL_UART_Main_setBaudRateDivisor(K210_FACE_UART_INST,
        K210_FACE_UART_IBRD_40_MHZ_115200,
        K210_FACE_UART_FBRD_40_MHZ_115200);
#endif
}

static void configure_uart_rx(void)
{
    NVIC_DisableIRQ(K210_FACE_UART_IRQN);
#if K210_FACE_USE_UART_DMA
    NVIC_DisableIRQ(DMA_INT_IRQn);
#endif
    DL_UART_Main_disableInterrupt(K210_FACE_UART_INST,
                                  K210_FACE_UART_RX_INTERRUPTS);
#if K210_FACE_USE_UART_DMA
    DL_UART_Main_disableDMAReceiveEvent(K210_FACE_UART_INST,
                                        DL_UART_DMA_INTERRUPT_RX);
    DL_UART_Main_disableDMATransmitEvent(K210_FACE_UART_INST);
#endif
    DL_GPIO_initPeripheralInputFunctionFeatures(K210_FACE_UART_RX_IOMUX,
        K210_FACE_UART_RX_IOMUX_FUNC, DL_GPIO_INVERSION_DISABLE,
        DL_GPIO_RESISTOR_PULL_UP, DL_GPIO_HYSTERESIS_ENABLE,
        DL_GPIO_WAKEUP_DISABLE);
    DL_GPIO_initPeripheralOutputFunction(K210_FACE_UART_TX_IOMUX,
                                         K210_FACE_UART_TX_IOMUX_FUNC);
    init_selected_uart();
#if K210_FACE_USE_UART_DMA
    init_uart_dma();
    DL_UART_Main_enableFIFOs(K210_FACE_UART_INST);
#endif
    DL_UART_Main_setRXFIFOThreshold(K210_FACE_UART_INST,
                                    DL_UART_MAIN_RX_FIFO_LEVEL_ONE_ENTRY);
    DL_UART_Main_setTXFIFOThreshold(K210_FACE_UART_INST,
                                    DL_UART_TX_FIFO_LEVEL_1_2_EMPTY);
    DL_UART_Main_setRXInterruptTimeout(K210_FACE_UART_INST, 2U);
    drain_uart_rx_fifo();
    sample_uart_rx_pin();
    DL_UART_Main_clearInterruptStatus(K210_FACE_UART_INST,
                                      K210_FACE_UART_RX_INTERRUPTS);
    NVIC_ClearPendingIRQ(K210_FACE_UART_IRQN);
#if K210_FACE_USE_UART_DMA
    NVIC_ClearPendingIRQ(DMA_INT_IRQn);
    DL_UART_Main_enableDMAReceiveEvent(K210_FACE_UART_INST,
                                       DL_UART_DMA_INTERRUPT_RX);
    DL_UART_Main_enableDMATransmitEvent(K210_FACE_UART_INST);
#endif
    DL_UART_Main_enableInterrupt(K210_FACE_UART_INST,
                                 K210_FACE_UART_RX_INTERRUPTS);
    DL_UART_Main_enable(K210_FACE_UART_INST);
#if K210_FACE_USE_UART_DMA
    start_dma_rx();
    NVIC_EnableIRQ(DMA_INT_IRQn);
#endif
    NVIC_EnableIRQ(K210_FACE_UART_IRQN);
}

