iapetuszzb/car/Drivers/K210/k210_face.c
static bool pop_rx_line(char *line, uint32_t line_len)
{
    uint32_t i;
    uint8_t read_index;
    bool has_line;

    if ((line == NULL) || (line_len == 0U)) {
        return false;
    }

    NVIC_DisableIRQ(K210_FACE_UART_IRQN);
#if K210_FACE_USE_UART_DMA
    NVIC_DisableIRQ(DMA_INT_IRQn);
#endif
    has_line = (g_rx_queue_count > 0U);
    if (has_line) {
        read_index = g_rx_queue_tail;
        for (i = 0U; (i < (line_len - 1U)) &&
             (g_rx_line_queue[read_index][i] != '\0');
             i++) {
            line[i] = (char)g_rx_line_queue[read_index][i];
        }
        line[i] = '\0';
        g_rx_queue_tail = next_rx_queue_index(g_rx_queue_tail);
        g_rx_queue_count--;
    }
#if K210_FACE_USE_UART_DMA
    NVIC_EnableIRQ(DMA_INT_IRQn);
#endif
    NVIC_EnableIRQ(K210_FACE_UART_IRQN);

    return has_line;
}

static bool parse_next_int(const char **cursor, int32_t *value)
{
    const char *p = *cursor;
    int32_t sign = 1;
    int32_t result = 0;
    bool has_digit = false;

    while ((*p != '\0') && (((*p < '0') || (*p > '9')) && (*p != '-'))) {
        p++;
    }

    if (*p == '-') {
        sign = -1;
        p++;
    }

    while ((*p >= '0') && (*p <= '9')) {
        result = (result * 10) + (*p - '0');
        has_digit = true;
        p++;
    }

    if (!has_digit) {
        return false;
    }

    *value = result * sign;
    *cursor = p;
    return true;
}

static bool parse_next_score_permille(const char **cursor, uint16_t *score)
{
    const char *p = *cursor;
    uint32_t whole = 0U;
    uint32_t frac = 0U;
    uint32_t frac_digits = 0U;
    bool has_digit = false;

    while ((*p != '\0') && ((*p < '0') || (*p > '9'))) {
        p++;
    }

    while ((*p >= '0') && (*p <= '9')) {
        whole = (whole * 10U) + (uint32_t)(*p - '0');
        has_digit = true;
        p++;
    }

    if (*p == '.') {
        p++;
        while ((*p >= '0') && (*p <= '9')) {
            if (frac_digits < 3U) {
                frac = (frac * 10U) + (uint32_t)(*p - '0');
                frac_digits++;
            }
            has_digit = true;
            p++;
        }
    }

    if (!has_digit) {
        return false;
    }

    while (frac_digits < 3U) {
        frac *= 10U;
        frac_digits++;
    }

    if (whole >= 1U) {
        *score = 1000U;
    } else {
        *score = (uint16_t)clamp_i32((int32_t)frac, 0, 1000);
    }

    *cursor = p;
    return true;
}

static const char *find_detection_start(const char *line)
{
    const char *start = strstr(line, "[[");

    if (start == NULL) {
        return NULL;
    }
    return start + 2;
}

static bool detection_is_valid(const K210FaceDetection *detection)
{
    if (detection->score_permille < K210_FACE_MIN_SCORE_PERMILLE) {
        return false;
    }
    if ((detection->w == 0U) || (detection->h == 0U)) {
        return false;
    }
    if ((detection->x >= K210_FACE_IMAGE_W) ||
        (detection->y >= K210_FACE_IMAGE_H)) {
        return false;
    }
    if (((uint32_t)detection->x + detection->w) > K210_FACE_IMAGE_W) {
        return false;
    }
    if (((uint32_t)detection->y + detection->h) > K210_FACE_IMAGE_H) {
        return false;
    }
    return true;
}

static bool parse_detection_line(const char *line,
                                 K210FaceDetection *detection)
{
    const char *p = find_detection_start(line);
    int32_t values[5];
    uint16_t score;
    uint32_t i;
    unsigned long now;

    if ((p == NULL) || (detection == NULL)) {
        return false;
    }

    for (i = 0U; i < 5U; i++) {
        if (!parse_next_int(&p, &values[i])) {
            return false;
        }
    }

    if (!parse_next_score_permille(&p, &score)) {
        return false;
    }

    if ((values[0] < 0) || (values[1] < 0) ||
        (values[2] <= 0) || (values[3] <= 0) ||
        (values[4] < 0)) {
        return false;
    }

    detection->x = (uint16_t)values[0];
    detection->y = (uint16_t)values[1];
    detection->w = (uint16_t)values[2];
    detection->h = (uint16_t)values[3];
    detection->class_id = (uint8_t)values[4];
    detection->score_permille = score;
    detection->center_x = detection->x + (detection->w / 2U);
    detection->center_y = detection->y + (detection->h / 2U);
    (void)mspm0_get_clock_ms(&now);
    detection->last_update_ms = (uint32_t)now;
    detection->valid = detection_is_valid(detection);

    return detection->valid;
}

static bool parse_face_line(const char *line, K210FaceDetection *detection)
{
    const char *p;
    int32_t values[6];
    uint32_t i;
    unsigned long now;

    if ((line == NULL) || (detection == NULL)) {
        return false;
    }

    p = strstr(line, "FACE,");
    if (p == NULL) {
        return false;
    }
    p += 5;

    for (i = 0U; i < 6U; i++) {
        if (!parse_next_int(&p, &values[i])) {
            return false;
        }
    }

    if ((values[0] < 0) || (values[1] < 0) ||
        (values[2] <= 0) || (values[3] <= 0) ||
        (values[4] < 0)) {
        return false;
    }

    detection->x = (uint16_t)values[0];
    detection->y = (uint16_t)values[1];
    detection->w = (uint16_t)values[2];
    detection->h = (uint16_t)values[3];
    detection->class_id = (uint8_t)values[4];
    detection->score_permille =
        (uint16_t)clamp_i32(values[5], 0, 1000);
    detection->center_x = detection->x + (detection->w / 2U);
    detection->center_y = detection->y + (detection->h / 2U);
    (void)mspm0_get_clock_ms(&now);
    detection->last_update_ms = (uint32_t)now;
    detection->valid = detection_is_valid(detection);

    return detection->valid;
}

static void enable_tracking_motors(void)
{
    if (!g_motors_enabled) {
        StepperGimbal_Enable(STEPPER_GIMBAL_MOTOR_A, true);
        StepperGimbal_Enable(STEPPER_GIMBAL_MOTOR_B, true);
        g_motors_enabled = true;
    }
}

static void track_pid_init(K210FacePid *pid, float kp, float ki, float kd)
{
    pid->kp = kp;
    pid->ki = ki;
    pid->kd = kd;
    pid->setpoint = 0.0f;
    pid->integral = 0.0f;
    pid->last_error = 0.0f;
    pid->last_input = 0.0f;
    pid->input_ready = false;
}

