iapetuszzb/car/Drivers/K210/k210_face.c
static float speed_pid_update(K210FacePid *pid, float error)
{
    float derivative;
    float output;

    if (pid->input_ready) {
        derivative = error - pid->last_error;
    } else {
        derivative = 0.0f;
        pid->input_ready = true;
    }

    pid->integral += error;
    pid->integral = clamp_f32(pid->integral,
                              -K210_FACE_SPEED_PID_I_MAX,
                              K210_FACE_SPEED_PID_I_MAX);

    output = (pid->kp * error) +
             (pid->ki * pid->integral) +
             (pid->kd * derivative);
    output = clamp_f32(output,
                       -K210_FACE_SPEED_PID_OUT_MAX,
                       K210_FACE_SPEED_PID_OUT_MAX);

    pid->last_error = error;
    pid->last_input = error;
    return output;
}

static void speed_pid_reset(K210FacePid *pid)
{
    pid->integral = 0.0f;
    pid->last_error = 0.0f;
    pid->last_input = 0.0f;
    pid->input_ready = false;
}

static float select_by_error(float abs_error, float small_error,
                             float large_error, float small_value,
                             float mid_value, float large_value)
{
    if (abs_error < small_error) {
        return small_value;
    }
    if (abs_error >= large_error) {
        return large_value;
    }
    return mid_value;
}

static float slew_speed(float current_speed, float target_speed,
                        float accel_hz_per_s)
{
    float max_delta =
        accel_hz_per_s * ((float)K210_FACE_CONTROL_INTERVAL_MS / 1000.0f);

    if (target_speed > (current_speed + max_delta)) {
        return current_speed + max_delta;
    }
    if (target_speed < (current_speed - max_delta)) {
        return current_speed - max_delta;
    }
    return target_speed;
}

static int32_t speed_to_signed_step_hz(float speed_hz,
                                       uint32_t min_step_hz,
                                       uint32_t max_step_hz)
{
    float mag = abs_f32(speed_hz);
    int32_t signed_step_hz;

    if (mag < 1.0f) {
        return 0;
    }
    if (mag < (float)min_step_hz) {
        mag = (float)min_step_hz;
    }
    if (mag > (float)max_step_hz) {
        mag = (float)max_step_hz;
    }

    signed_step_hz = (int32_t)(mag + 0.5f);
    return (speed_hz >= 0.0f) ? signed_step_hz : -signed_step_hz;
}

static void apply_axis_speed(StepperGimbalMotor motor,
                             float *current_speed_hz,
                             float target_speed_hz,
                             float accel_hz_per_s,
                             uint32_t min_step_hz,
                             uint32_t max_step_hz)
{
    int32_t signed_step_hz;

    if (abs_f32(target_speed_hz) < K210_FACE_SPEED_STOP_EPS_HZ) {
        *current_speed_hz = 0.0f;
        if (StepperGimbal_SetVelocity(motor, 0)) {
            g_track_command_count++;
        }
        return;
    }

    *current_speed_hz = slew_speed(*current_speed_hz,
                                   target_speed_hz,
                                   accel_hz_per_s);
    signed_step_hz = speed_to_signed_step_hz(*current_speed_hz,
                                             min_step_hz,
                                             max_step_hz);

    if (StepperGimbal_SetVelocity(motor, signed_step_hz)) {
        g_track_command_count++;
    }
}

static void stop_axis_tracking(StepperGimbalMotor motor,
                               float *current_speed_hz,
                               K210FacePid *pid)
{
    *current_speed_hz = 0.0f;
    speed_pid_reset(pid);
    (void)StepperGimbal_SetVelocity(motor, 0);
}

static bool consume_compact_frame(int32_t *error_x,
                                  int32_t *error_y,
                                  bool *target_valid)
{
    bool has_frame;

    NVIC_DisableIRQ(K210_FACE_UART_IRQN);
#if K210_FACE_USE_UART_DMA
    NVIC_DisableIRQ(DMA_INT_IRQn);
#endif
    has_frame = g_compact_frame_pending;
    if (has_frame) {
        *error_x = g_compact_error_x;
        *error_y = g_compact_error_y;
        *target_valid = (g_compact_target_valid != 0U);
        g_compact_frame_pending = false;
    }
#if K210_FACE_USE_UART_DMA
    NVIC_EnableIRQ(DMA_INT_IRQn);
#endif
    NVIC_EnableIRQ(K210_FACE_UART_IRQN);

    return has_frame;
}

static void update_tracking_error(int32_t new_error_x,
                                  int32_t new_error_y,
                                  bool target_valid,
                                  uint32_t update_ms)
{
    uint32_t frame_dt_ms;
    float frame_dt_s;

    if (!g_tracking_enabled) {
        return;
    }

    if (!target_valid) {
        g_target_valid = false;
        g_target_frame_pending = false;
        g_error_vx = 0.0f;
        g_error_vy = 0.0f;
        return;
    }

    if (g_target_valid) {
        frame_dt_ms = update_ms - g_target_update_ms;
        if (frame_dt_ms == 0U) {
            frame_dt_ms = 1U;
        }
        frame_dt_s = (float)frame_dt_ms * 0.001f;
        g_error_vx = ((float)new_error_x - (float)g_last_error_x) /
                     frame_dt_s;
        g_error_vy = ((float)new_error_y - (float)g_last_error_y) /
                     frame_dt_s;
    } else {
        g_error_vx = 0.0f;
        g_error_vy = 0.0f;
    }

    g_last_error_x = new_error_x;
    g_last_error_y = new_error_y;
    g_predicted_error_x = new_error_x;
    g_predicted_error_y = new_error_y;
    g_target_update_ms = update_ms;
    g_target_valid = true;
    g_target_frame_pending = true;
}

static void process_compact_tracking_frame(void)
{
    int32_t error_x;
    int32_t error_y;
    bool target_valid;
    unsigned long now;

    if (!consume_compact_frame(&error_x, &error_y, &target_valid)) {
        return;
    }

    (void)mspm0_get_clock_ms(&now);
    update_tracking_error(error_x, error_y, target_valid, (uint32_t)now);
}

static void service_tracking_control(void)
{
    unsigned long now;
    int32_t predicted_error_x;
    int32_t predicted_error_y;
    float abs_error_a;
    float abs_error_b;
    float speed_a;
    float speed_b;
    float speed_limit_a;
    float speed_limit_b;
    float accel_a;
    float accel_b;
    uint32_t target_age_ms;

#if !K210_FACE_GIMBAL_OUTPUT_ENABLE
    return;
#endif

