iapetuszzb/car/Drivers/K210/k210_face.c
    if (!g_tracking_enabled || !g_target_valid) {
        stop_axis_tracking(STEPPER_GIMBAL_MOTOR_A,
                           &g_command_speed_a_hz, &g_speed_pid_a);
        stop_axis_tracking(STEPPER_GIMBAL_MOTOR_B,
                           &g_command_speed_b_hz, &g_speed_pid_b);
        return;
    }

    enable_tracking_motors();

    (void)mspm0_get_clock_ms(&now);
    target_age_ms = (uint32_t)now - g_target_update_ms;
    if (target_age_ms > K210_FACE_TARGET_FRESH_TIMEOUT_MS) {
        g_target_valid = false;
        g_target_frame_pending = false;
        g_error_vx = 0.0f;
        g_error_vy = 0.0f;
        stop_axis_tracking(STEPPER_GIMBAL_MOTOR_A,
                           &g_command_speed_a_hz, &g_speed_pid_a);
        stop_axis_tracking(STEPPER_GIMBAL_MOTOR_B,
                           &g_command_speed_b_hz, &g_speed_pid_b);
        return;
    }
    if (!g_target_frame_pending) {
        return;
    }
    g_target_frame_pending = false;

    predicted_error_x =
        (int32_t)((float)g_last_error_x +
                  (g_error_vx * K210_FACE_PREDICTION_TIME_S));
    predicted_error_y =
        (int32_t)((float)g_last_error_y +
                  (g_error_vy * K210_FACE_PREDICTION_TIME_S));
    g_predicted_error_x = predicted_error_x;
    g_predicted_error_y = predicted_error_y;

    abs_error_a = abs_f32((float)predicted_error_x);
    abs_error_b = abs_f32((float)predicted_error_y);

    if (abs_error_a <= (float)K210_FACE_CENTER_DEADZONE_X) {
        stop_axis_tracking(STEPPER_GIMBAL_MOTOR_A,
                           &g_command_speed_a_hz, &g_speed_pid_a);
    } else {
        speed_limit_a = select_by_error(abs_error_a,
            K210_FACE_A_ERR_SMALL, K210_FACE_A_ERR_LARGE,
            K210_FACE_A_SPEED_LIMIT_SMALL,
            K210_FACE_A_SPEED_LIMIT_MID,
            K210_FACE_A_SPEED_LIMIT_LARGE);
        accel_a = select_by_error(abs_error_a,
            K210_FACE_A_ERR_SMALL, K210_FACE_A_ERR_LARGE,
            K210_FACE_A_ACCEL_SMALL,
            K210_FACE_A_ACCEL_MID,
            K210_FACE_A_ACCEL_LARGE);
        speed_a = K210_FACE_AXIS_A_DIR *
                  speed_pid_update(&g_speed_pid_a,
                                   (float)predicted_error_x);
        speed_a = clamp_f32(speed_a, -speed_limit_a, speed_limit_a);
        apply_axis_speed(STEPPER_GIMBAL_MOTOR_A,
                         &g_command_speed_a_hz, speed_a, accel_a,
                         K210_FACE_A_MIN_STEP_HZ,
                         K210_FACE_A_MAX_STEP_HZ);
    }

    if (abs_error_b <= (float)K210_FACE_CENTER_DEADZONE_Y) {
        stop_axis_tracking(STEPPER_GIMBAL_MOTOR_B,
                           &g_command_speed_b_hz, &g_speed_pid_b);
    } else {
        speed_limit_b = select_by_error(abs_error_b,
            K210_FACE_B_ERR_SMALL, K210_FACE_B_ERR_LARGE,
            K210_FACE_B_SPEED_LIMIT_SMALL,
            K210_FACE_B_SPEED_LIMIT_MID,
            K210_FACE_B_SPEED_LIMIT_LARGE);
        accel_b = select_by_error(abs_error_b,
            K210_FACE_B_ERR_SMALL, K210_FACE_B_ERR_LARGE,
            K210_FACE_B_ACCEL_SMALL,
            K210_FACE_B_ACCEL_MID,
            K210_FACE_B_ACCEL_LARGE);
        speed_b = K210_FACE_AXIS_B_DIR *
                  speed_pid_update(&g_speed_pid_b,
                                   (float)predicted_error_y);
        speed_b = clamp_f32(speed_b, -speed_limit_b, speed_limit_b);
        apply_axis_speed(STEPPER_GIMBAL_MOTOR_B,
                         &g_command_speed_b_hz, speed_b, accel_b,
                         K210_FACE_B_MIN_STEP_HZ,
                         K210_FACE_B_MAX_STEP_HZ);
    }
}

static void update_tracking_target(const K210FaceDetection *detection)
{
    int32_t new_error_x;
    int32_t new_error_y;

    if (!g_tracking_enabled || !detection->valid) {
        return;
    }

    g_object_center_x = detection->center_x;
    g_object_center_y = detection->center_y;
    new_error_x = K210_FACE_CENTER_X - (int32_t)detection->center_x;
    new_error_y = K210_FACE_CENTER_Y - (int32_t)detection->center_y;
    update_tracking_error(new_error_x, new_error_y, true,
                          detection->last_update_ms);
}

void K210Face_Init(void)
{
    g_rx_index = 0U;
    g_rx_queue_head = 0U;
    g_rx_queue_tail = 0U;
    g_rx_queue_count = 0U;
    g_rx_overflow_count = 0U;
    g_has_detection = false;
    g_motors_enabled = false;
    g_rx_byte_count = 0U;
    g_rx_line_count = 0U;
    g_rx_edge_count = 0U;
    g_rx_error_count = 0U;
    g_rx_dma_block_count = 0U;
    g_tx_dma_done_count = 0U;
    g_tx_dma_busy = false;
    g_valid_detection_count = 0U;
    g_parse_error_count = 0U;
    g_last_rx_byte = 0U;
    g_rx_pin_level = 0U;
    g_track_command_count = 0U;
    g_last_error_x = 0;
    g_last_error_y = 0;
    g_object_center_x = K210_FACE_CENTER_X;
    g_object_center_y = K210_FACE_CENTER_Y;
    g_target_valid = false;
    g_target_update_ms = 0U;
    g_control_elapsed_ms = 0U;
    track_pid_init(&g_speed_pid_a, K210_FACE_SPEED_X_KP,
                   K210_FACE_SPEED_X_KI, K210_FACE_SPEED_X_KD);
    track_pid_init(&g_speed_pid_b, K210_FACE_SPEED_Y_KP,
                   K210_FACE_SPEED_Y_KI, K210_FACE_SPEED_Y_KD);
    g_error_vx = 0.0f;
    g_error_vy = 0.0f;
    g_predicted_error_x = 0;
    g_predicted_error_y = 0;
    g_command_speed_a_hz = 0.0f;
    g_command_speed_b_hz = 0.0f;
    g_target_frame_pending = false;
    g_compact_parse_state = 0U;
    g_compact_parse_values[0] = 0;
    g_compact_parse_values[1] = 0;
    g_compact_parse_values[2] = 0;
    g_compact_parse_value = 0;
    g_compact_parse_sign = 1;
    g_compact_parse_has_digit = false;
    g_compact_error_x = 0;
    g_compact_error_y = 0;
    g_compact_target_valid = 0U;
    g_compact_frame_pending = false;
#if K210_FACE_GIMBAL_OUTPUT_ENABLE
    StepperGimbal_SetHoldAfterMove(true);
#endif
    configure_uart_rx();
}

void K210Face_Task(void)
{
    char line[K210_FACE_RX_LINE_LEN];
    K210FaceDetection detection;
    uint32_t processed_lines = 0U;

    sample_uart_rx_pin();
#if !K210_FACE_USE_UART_DMA
    drain_uart_rx_fifo_from_task();
#endif

    while (processed_lines < K210_FACE_PARSE_LINES_PER_TASK) {
        if (!pop_rx_line(line, sizeof(line))) {
            break;
        }
        processed_lines++;

        if ((strstr(line, "PING") != NULL) || (strstr(line, "BOOT") != NULL)) {
            continue;
        }

        if (parse_face_line(line, &detection) ||
            parse_detection_line(line, &detection)) {
            g_latest_detection = detection;
            g_has_detection = true;
            g_valid_detection_count++;
            update_tracking_target(&detection);
        } else {
            g_parse_error_count++;
        }
    }
}

