iapetuszzb/car/Drivers/K210/k210_face.c
void K210Face_Tick1ms(void)
{
    process_compact_tracking_frame();
    g_control_elapsed_ms++;
    if (g_control_elapsed_ms >= K210_FACE_CONTROL_INTERVAL_MS) {
        g_control_elapsed_ms = 0U;
        service_tracking_control();
    }
}

bool K210Face_SendDMA(const uint8_t *data, uint16_t len)
{
#if K210_FACE_USE_UART_DMA
    uint16_t i;

    if ((data == NULL) || (len == 0U) ||
        (len > K210_FACE_DMA_TX_BUFFER_LEN)) {
        return false;
    }

    NVIC_DisableIRQ(DMA_INT_IRQn);
    if (g_tx_dma_busy) {
        NVIC_EnableIRQ(DMA_INT_IRQn);
        return false;
    }

    for (i = 0U; i < len; i++) {
        g_dma_tx_buffer[i] = data[i];
    }

    g_tx_dma_busy = true;
    DL_DMA_disableChannel(DMA, K210_FACE_DMA_TX_CH);
    DL_DMA_setSrcAddr(DMA, K210_FACE_DMA_TX_CH,
                      (uint32_t)&g_dma_tx_buffer[0]);
    DL_DMA_setDestAddr(DMA, K210_FACE_DMA_TX_CH,
                       (uint32_t)&K210_FACE_UART_INST->TXDATA);
    DL_DMA_setTransferSize(DMA, K210_FACE_DMA_TX_CH, len);
    DL_DMA_clearInterruptStatus(DMA, K210_FACE_DMA_TX_INTERRUPT);
    DL_DMA_enableChannel(DMA, K210_FACE_DMA_TX_CH);
    NVIC_EnableIRQ(DMA_INT_IRQn);
    return true;
#else
    (void)data;
    (void)len;
    return false;
#endif
}

bool K210Face_SendStringDMA(const char *text)
{
    uint16_t len = 0U;

    if (text == NULL) {
        return false;
    }

    while ((text[len] != '\0') &&
           (len < (K210_FACE_DMA_TX_BUFFER_LEN - 1U))) {
        len++;
    }

    if (text[len] != '\0') {
        return false;
    }

    return K210Face_SendDMA((const uint8_t *)text, len);
}

bool K210Face_IsTxBusy(void)
{
    return g_tx_dma_busy;
}

void K210Face_SetTrackingEnabled(bool enabled)
{
#if K210_FACE_GIMBAL_OUTPUT_ENABLE
    g_tracking_enabled = enabled;
#else
    (void)enabled;
    g_tracking_enabled = false;
#endif
}

bool K210Face_GetLatest(K210FaceDetection *detection)
{
    if ((detection == NULL) || !g_has_detection) {
        return false;
    }

    *detection = g_latest_detection;
    return true;
}

uint32_t K210Face_GetValidCount(void)
{
    return g_valid_detection_count;
}

uint32_t K210Face_GetRxByteCount(void)
{
    return g_rx_byte_count;
}

uint32_t K210Face_GetRxLineCount(void)
{
    return g_rx_line_count;
}

uint32_t K210Face_GetRxEdgeCount(void)
{
    return g_rx_edge_count;
}

uint32_t K210Face_GetRxErrorCount(void)
{
    return g_rx_error_count;
}

uint32_t K210Face_GetRxDmaBlockCount(void)
{
    return g_rx_dma_block_count;
}

uint32_t K210Face_GetTxDmaDoneCount(void)
{
    return g_tx_dma_done_count;
}

uint32_t K210Face_GetParseErrorCount(void)
{
    return g_parse_error_count;
}

uint32_t K210Face_GetTrackCommandCount(void)
{
    return g_track_command_count;
}

int32_t K210Face_GetLastErrorX(void)
{
    return g_last_error_x;
}

int32_t K210Face_GetLastErrorY(void)
{
    return g_last_error_y;
}

uint8_t K210Face_GetLastByte(void)
{
    return g_last_rx_byte;
}

uint8_t K210Face_GetRxPinLevel(void)
{
    return g_rx_pin_level;
}

static void k210_uart_irq_handler(void)
{
    for (;;) {
        switch (DL_UART_Main_getPendingInterrupt(K210_FACE_UART_INST)) {
#if !K210_FACE_USE_UART_DMA
            case DL_UART_MAIN_IIDX_RX:
#endif
            case DL_UART_MAIN_IIDX_RX_TIMEOUT_ERROR:
#if K210_FACE_USE_UART_DMA
                process_dma_rx_partial();
#else
                drain_uart_rx_fifo();
#endif
                break;

            case DL_UART_MAIN_IIDX_RXD_POS_EDGE:
            case DL_UART_MAIN_IIDX_RXD_NEG_EDGE:
                g_rx_edge_count++;
                sample_uart_rx_pin();
                DL_UART_Main_clearInterruptStatus(
                    K210_FACE_UART_INST, K210_FACE_UART_RX_EDGE_INTERRUPTS);
                break;

            case DL_UART_MAIN_IIDX_OVERRUN_ERROR:
            case DL_UART_MAIN_IIDX_BREAK_ERROR:
            case DL_UART_MAIN_IIDX_PARITY_ERROR:
            case DL_UART_MAIN_IIDX_FRAMING_ERROR:
            case DL_UART_MAIN_IIDX_NOISE_ERROR:
                g_rx_error_count++;
#if K210_FACE_USE_UART_DMA
                process_dma_rx_partial();
#else
                drain_uart_rx_fifo();
#endif
                DL_UART_Main_clearInterruptStatus(K210_FACE_UART_INST,
                                                  K210_FACE_UART_RX_INTERRUPTS);
                break;

            case DL_UART_MAIN_IIDX_NO_INTERRUPT:
                return;

            default:
                DL_UART_Main_clearInterruptStatus(K210_FACE_UART_INST,
                                                  K210_FACE_UART_RX_INTERRUPTS);
                return;
        }
    }
}

#if APP_ENABLE_VISION_UART
#if K210_FACE_USE_UART1_PA9_RX
void UART1_IRQHandler(void)
{
    k210_uart_irq_handler();
}
#else
void UART0_IRQHandler(void)
{
    k210_uart_irq_handler();
}
#endif
#endif

#if APP_ENABLE_VISION_UART && K210_FACE_USE_UART_DMA
void DMA_IRQHandler(void)
{
    for (;;) {
        switch (DL_DMA_getPendingInterrupt(DMA)) {
            case DL_DMA_EVENT_IIDX_DMACH0:
                g_rx_dma_block_count++;
                process_dma_rx_bytes(K210_FACE_DMA_RX_BUFFER_LEN);
                start_dma_rx();
                break;

            case DL_DMA_EVENT_IIDX_DMACH1:
                g_tx_dma_done_count++;
                g_tx_dma_busy = false;
                DL_DMA_disableChannel(DMA, K210_FACE_DMA_TX_CH);
                break;

            case DL_DMA_EVENT_IIDX_ADDR_ERROR:
            case DL_DMA_EVENT_IIDX_DATA_ERROR:
                g_rx_error_count++;
                g_tx_dma_busy = false;
                DL_DMA_disableChannel(DMA, K210_FACE_DMA_RX_CH);
                DL_DMA_disableChannel(DMA, K210_FACE_DMA_TX_CH);
                start_dma_rx();
                break;

            case DL_DMA_EVENT_IIDX_NO_INTR:
                return;

            default:
                return;
        }
    }
}
#endif
